package leo.work.support.Info;

/**
 * ---------------------------------------------------------------------------------------------
 * 功能描述:
 * ---------------------------------------------------------------------------------------------
 * 时　　间: 2018/5/4.
 * ---------------------------------------------------------------------------------------------
 * 代码创建: 刘桂安
 * ---------------------------------------------------------------------------------------------
 * 代码备注:
 * ---------------------------------------------------------------------------------------------
 **/
public class StatusInfo {
    //正在加载
    public static final String Loading = "Loading";
    //没有内容
    public static final String NullContent = "NullContent";
    //没有网络
    public static final String NullNetwork = "NullNetwork";
    //显示
    public static final String ShowView = "ShowView";
}
